bash-completion@2
black
blast
clamav
colordiff
coreutils
diffutils
eigen
emacs
fastme
findutils
git-lfs
gnupg
imagemagick
jq
just
lesspipe
libpq
libressl
llvm
neatvi
node
pandoc
postgresql@14
python-tk@3.10
python-tk@3.9
rsync
shellcheck
sloccount
tmux
unison
wdiff
wget
