awscli
bash-completion@2
black
blast
bowtie2
clamav
colordiff
coreutils
curl
diffutils
docutils
eigen
emacs
fastme
findutils
fzf
gh
git-lfs
global
graphviz
htop
igv
imagemagick
jq
just
libpq
llvm
pandoc
pass-git-helper
postgresql@14
python-tk@3.10
python-tk@3.11
rsync
samtools
shellcheck
sloccount
tmux
tokei
unison
wdiff
wget
xsv
