autoconf
awscli
bash-completion@2
bcftools
bedtools
black
blast
bowtie2
capnp
clamav
colordiff
coreutils
curl
diffutils
docutils
eigen
emacs
fastme
findutils
fzf
git-graph
git-lfs
global
glow
graphviz
helix
htop
hwatch
igv
imagemagick
jq
just
libpq
llvm
mafft
minimap2
pandoc
pass-git-helper
pigz
pipx
postgresql@14
pstree
python-tk@3.10
python-tk@3.11
python-tk@3.12
python-tk@3.13
python-tk@3.9
rsync
samtools
shellcheck
sloccount
tidy-html5
tmux
tokei
tox
unison
uv
wdiff
wget
xsv
