# NOTE: Changes to the `args` parameter are not automatically applied by `brew
# bundle` for a formula that has already been installed. Run `brew uninstall
# --force <formula>` before `brew bundle` to ensure that the options used for
# installation match those specified in `args`.

# ----  UTILITIES  ----

tap "homebrew/core"
tap "homebrew/services"
tap "shvenkat/extra"

# General use.
brew "clamav"
brew "colordiff"
brew "coreutils"
brew "dos2unix"
brew "findutils", args: ["with-default-names"]
brew "git", args: ["with-blk-sha1", "with-pcre2"]
brew "gnupg", args: ["with-readline"]
brew "graphviz"
brew "grep", args: ["with-default-names"]
brew "gzip"
brew "htop"
brew "ispell"
brew "jq"
brew "less", args: ["with-pcre"]
brew "loc"
brew "lesspipe"
brew "mosh"
brew "openssh"
brew "pandoc"
brew "pigz"
brew "rsync"
brew "source-highlight"
brew "tmux"
brew "tree"
brew "unison"
brew "watch"
brew "wdiff"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zstd"

# Programming.
brew "automake"
brew "cmake"
brew "coq"
brew "cscope"
brew "ctags"
brew "emacs", args: ["with-cocoa", "with-gnutls", "with-imagemagick@6", "with-librsvg", "with-modules"]
brew "gcc"
brew "git-flow"
brew "go"
brew "haskell-stack"
brew "idris"
brew "neovim"
brew "node@6"
brew "python"
brew "r"
brew "rust"
brew "shellcheck"
brew "sqlite"
brew "tokei"
brew "valgrind"

# Math and Science.
brew "blast"
brew "bowtie2"
brew "igv"
brew "samtools"

# Cloud.
brew "awscli"


# ----  APPS  ----

tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# Apps.
cask "docker"
cask "firefox"
cask "google-chrome"
cask "shvenkat/extra/isabelle2014"
cask "iterm2"
cask "java8"
cask "mactex" unless system "tex --version >/dev/null"
cask "slack"
cask "xquartz"

# Fonts.
# cask "font-droid-sans-mono"
cask "font-dejavu-sans"
cask "font-fira-code"
cask "font-fira-mono"
